NewCustomerCompositeApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:star="http://j2ee.netbeans.org/wsdl/NewCustomerProcessBpelModule/StartProcessWSDL">
  <soapenv:Body>
    <star:StartProcessWSDLOperation>
      <part1>?string?</part1>
    </star:StartProcessWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>